'-------------------------------------Git----------------------------'

#Git - это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git 
# можно организовывать командную работу.

'''
Github - это веб-сайт для размещение git-репозиториев в совместной разработке прокетов.
Репозиторий - это хранилище нашего кода и истории его измений
'''

#Команда Git:
'''
1. git init - создает локальный репозиторий, в той директории, в которой была прописана команда.
2. git add . - это команда для добавления изменений в систему отлеживания гита
(вместо точки можно указывать любую директорию)
3. git commit -m "комментарий к коммиту": это команда для сохранения всех изменений с комментарием к ним
4. git branch -M main - это команда создает главную ветку main 
5. gti remote add origin "url": это команда связывает наш локальный репозиторий с удаленным репозиторием 
на Githube.
6. git status - статус версий
7. git push origin <main> - это команда отправки нашего изменений на удаленный репозиторий
8. git branch -  показывает на какой ветке мы находимся
9. git checkout - это команда перемещает нас с одной ветки на другую
10. git pull origin <main> - это команда стягивает все изменения с нашего
 удаленного репозиторий на локальный репозиторий
'''